---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MechanicalFitting.PartType
source: html/b25f4fc4-75f4-197d-0089-4ab74e9e9233.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalFitting.PartType Property

The part type of the mechanical fitting.

## Syntax (C#)
```csharp
public PartType PartType { get; }
```